[
    {
        "key": 1,
        "abbr": "b",
        "title": "Beomlog",
        "stacks": ["react", "typescript", "redux", "sass", "firebase"],
        "libraries": ["react-router", "redux-saga", "redux-middleware", "CKEditor5"],
        "description": "‘Beomlog’ is a personal blog project using Google Firestore as the backend and database. It is an SPA react website. For good maintenance, I have written tech log for the development, and the codes were refactored as much as possible.\nBeomlog was primarily planned to service a personal blog. People can only access to the other people’s posts by either entering directly to the post using post Id, or via the homepage where the latest 10 posts are shown to people.\nThe application handles the authentication using firebase auth service, and the firestore database holds the information about posts, category, user data, etc. The application has all the basic features of personal blog space, and I am planning to add more special features that can specialise ‘Beomlog’ from other blog platforms.\nThe codes on react were written 97% with Typescript (and 3% Javascript, to use the CKEditor5 open source code) for easier tracking and maintenance. Redux was used to manage the states of user, post, category posts, dialog and loading state. Redux-saga and Redux-middleware was used to handle the asynchronous actions required for CRUD of data on firestore database. Sass was used with help of ‘node-sass’ library to style the components, and react-router was used as well. As an editor for the blog post writing, CKEditor5 was used.",
        "siteUrls": {
            "pageUrl": "https://beomlog.me/home",
            "githubUrl": "https://github.com/beomseok-kang/beomlog-start"
        }
    },
    {
        "key": 2,
        "abbr": "wlt",
        "title": "Watch LCK Together",
        "stacks": ["react", "redux", "styledcomponents", "nodejs", "express", "socketio", "nextjs"],
        "libraries": [],
        "description": "‘Watch LCK Together’ is a full-stack web development project, which was made in order to service an anonymous chatting, and to make people to feel like if they are watching the LCK (League of Legends Challengers Korea, Pro Game League in Korea) and chatting together in a room.\nThe main feature of this service is that the chats appears on the YouTube screen, so that the people who are watching together can see the chats instantaneously while they are watching the video, making them to feel that they are actually watching and chatting together in a room.\nThe front-end components styling was done using styled-components, and server-side rendering (SSR) was implemented using Next.js. The main theme colour of the webpage was black and grey, mainly because LCK’s theme colour is black. The back-end of this project was built on Express and Node.js. The chatting system was produced using Socket.io, and the 'room' system was used to separate users within different room.\nThe application is being serviced on domain: wlt.kr, and I am planning to promote the service and gather users. The deployment was done using AWS Lightsail, where the instance is placed in South Korea.",
        "siteUrls": {
            "pageUrl": "http://wlt.kr/lobby",
            "githubUrl": "https://github.com/beomseok-kang/wlt-server"
        }
    },
    {
        "key": 3,
        "abbr": "nr",
        "title": "Naver Redesign",
        "stacks": ["react", "javascript", "styledcomponents", "redux"],
        "libraries": ["react-router"],
        "description": "‘Naver Redesign’ is a react SPA, which was made with my personal question, “what would it be like if Naver was in a similar design with Google?” Then, I made a template page for the home and the search page, by mixing the features that can be found on both Naver and Google.\nI used ‘react-router-dom’ to provide the path for search, and used redux to manage the state of search history. Also, I used styled-components to style the components. The design was done by me, but the features and characteristics of designs were taken mainly from Naver and Google’s web design style. I tried to merge their positive features and dump the old or negative features, and I was able to learn which features can improve the user experience (UX).\nThe application is not planned to be developed further. However, with help of Naver search API or Google search API, I might later connect the website to the search APIs.",
        "siteUrls": {
            "pageUrl": "https://beomseok-kang.github.io/naver-redesign/",
            "githubUrl": "https://github.com/beomseok-kang/naver-redesign"
        }
    },
    {
        "key": 4,
        "abbr": "swh",
        "title": "So What Happened",
        "stacks": ["html5", "css3", "javascript"],
        "libraries": [],
        "description": "‘So What Happened?’ is a flutter app that is being serviced in South Korea, which the front-end was built by myself, the UI/UX design was done by myself and a friend (Junhyeok Hwang), and the back-end was constructed using Google firestore database.\nI used some external JS libraries to put some fade-in and fade-out effects on the page, and the page is to be further developed after the app gathers enough users so that the service on web becomes profitable and worth initiating.",
        "siteUrls": {
            "pageUrl": "https://beomseok-kang.github.io/swh-website/",
            "githubUrl": "https://github.com/beomseok-kang/swh-website"
        }
    },
    {
        "key": 5,
        "abbr": "rsb",
        "title": "React Sandbox",
        "stacks": ["react", "css3", "javascript", "styledcomponents"],
        "libraries": ["react-router"],
        "description": "It is a sandbox that I play with to test some interesting features or libraries. The page itself is build with React and vanilla javascript, using styled-components library for styling of components.\nThe webpage is to be used as my secondary blog that I can play with some interesting stuffs on react.\nI am keep updating stuffs on this blog when I find interesting stuffs. I am developing my interactive web designing ability starting from this blog. The design and codes are all done by me.",
        "siteUrls": {
            "pageUrl": "https://beomseok-kang.github.io/react-sandbox/",
            "githubUrl": "https://github.com/beomseok-kang/react-sandbox"
        }
    },
    {
        "key": 6,
        "abbr": "p",
        "title": "Portfolio",
        "stacks": ["html5", "css3", "javascript", "react", "typescript", "sass"],
        "libraries": [],
        "description": "The portfolio itself is made with HTML5, CSS3 and Javascript, and this portfolio description website is built with React with Typescript, and Sass (SCSS).",
        "siteUrls": {
            "pageUrl": "https://beomseok-kang.github.io/",
            "githubUrl": "https://github.com/beomseok-kang/beomseok-kang.github.io"
        }
    }
]